# Taps
tap 'homebrew/autoupdate'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap "homebrew/core"
tap "hashicorp/tap"

# Binaries
brew 'awscli'               # Official Amazon AWS command-line interface, also known as: awscli@2
brew 'bash'                 # Latest Bash version
brew 'bat'                  # Used for spatie/visit
brew 'checkov'              # Prevent cloud misconfigurations during build-time for IaC tools
brew 'cloud-nuke'           # CLI tool to nuke (delete) cloud resources
brew 'coreutils'            # Those that come with macOS are outdated
brew 'curl'                 # Get a file from an HTTP, HTTPS or FTP server
brew 'defaultbrowser'       # Command-line tool for getting & setting the default browser
brew 'direnv'               # Load/unload environment variables based on $PWD
brew 'ffmpeg'               # Play, record, convert, and stream audio and video
brew 'gh'                   # GitHub command-line tool
brew 'git'                  # Git - Distributed revision control system
brew 'gnu-sed'              # GNU "sed": to use it add this to your .rc file: PATH="/usr/local/opt/gnu-sed/libexec/gnubin:$PATH"
brew 'goenv'                # Go version management
brew 'gpg'                  # GNU Pretty Good Privacy (PGP) package
brew 'graphviz'             # Graph visualization software from AT&T and Bell Labs
brew 'grep'                 # GNU grep, egrep and fgre
brew 'helm'                 # Kubernetes package manager, also known as: helm@3
brew 'htop'                 # Improved top
brew 'httpie'               # User-friendly cURL replacement (command-line HTTP client)
brew 'jq'                   # Used for spatie/visit
brew 'k9s'                  # Kubernetes CLI To Manage Your Clusters In Style!
brew 'kube-linter'          # Static analysis tool for Kubernetes YAML files and Helm charts
brew 'kube-ps1'             # Kubernetes prompt info for bash and zsh
brew 'kubectl'              # Kubernetes command-line interface, also known as: kubectl@1.22
brew 'kubectx'              # Tool that can switch between kubectl contexts easily and create aliases
brew 'kubernetes-cli'       # Kubernetes command-line interface, also known as: kubectl@1.22
brew 'kubeseal'             # Kubernetes controller and tool for one-way encrypted Secrets
brew 'kubespy'              # Tools for observing Kubernetes resources in realtime
brew 'kustomize'            # Template-free customization of Kubernetes YAML manifests
brew 'mackup'               # Keep your Mac's application settings in sync
brew 'make'                 # Utility for directing compilation
brew 'mas'                  # Mac App Store manager
brew 'netcat'               # Utility for managing network connections
brew 'nmap'                 # Port scanning utility for large networks
brew 'oath-toolkit'         # Tools for one-time password authentication systems
brew 'pass'                 # Password manager
brew 'pass-otp'             # Pass extension for managing one-time-password tokens
brew 'pipenv'               # Python dependency management tool
brew 'pkg-config'           # Manage compile and link flags for libraries, also known as: pkgconfig
brew 'pre-commit'           # Framework for managing multi-language pre-commit hooks
brew 'proxychains-ng'       # Hook preloader
brew 'pstree'               # Show ps output as a tree
brew 'sponge'               # Soak up standard input and write to a file
brew 'svn'                  # Also known as: subversion@1.14, svn, version control system designed to be a better CVS Needed to install fonts
brew 'terraform-docs'       # Tool to generate documentation from Terraform modules
brew 'terragrunt'           # Thin wrapper for Terraform e.g. for locking state
brew 'tfenv'                # Terraform version manager inspired by rbenv
brew 'tflint'               # Linter for Terraform files
brew "tinyproxy"            # HTTP/HTTPS proxy for POSIX systems
brew 'yq'                   # Also known as: yq@4, process YAML documents from the CLI

# Spatie Medialibrary
brew 'jpegoptim' # Utility to optimize JPEG files
brew 'optipng'   # PNG file optimizer
brew 'pngquant'  # PNG image optimizing utility
brew 'svgo'      # Nodejs-based tool for optimizing SVG vector graphics files
brew 'gifsicle'  # GIF image/animation creator/editor

# Development PHP
brew 'php'
brew 'php@8.0'
brew 'composer'
brew 'imagemagick'
brew 'node'
brew 'yarn'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'redis'

# Apps
cask '1password'
cask 'aws-vault'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'helo'
cask 'insomnia'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'keybase'
cask 'meld'                     # Visual diff and merge tool
cask 'microsoft-remote-desktop'
cask 'pastebot'
cask 'peakhour'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'transmit'
cask 'tunnelbear'
cask 'tunnelblick'
cask 'tuple'
cask 'viber'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vnc-viewer'
cask 'webstorm'
cask 'zoom'

### ###cask 'figma'
### ###cask 'imageoptim'
### ###cask 'phpmon'
### ###cask 'ray'
### ###cask 'readdle-spark'
### ###cask 'screenflow'
### ###cask 'tinkerwell'
### ###cask 'whatsapp'
### ###cask 'zwift'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
